export const ua = {
  translation: {
    header: {
      skills: "Навички",
      about: "Про мене",
      projects: "Проєкти",
      contact: "Контакти",
    },
    about: {
      hi: "Привіт, я",
      full: "Я Full-Stack",
      dev: "JavaScript розробник",
      span: "Мені",
      message:
        "подобається створювати речі, які працюють добре і виглядають чудово. Я дбаю про чистий код, чітку логіку і постійну цікавість. Термін виконання важливий, але важливо також робити все правильно. Я знаходжу радість у з'єднанні деталей — перетворюючи як фронтенд, так і бекенд на щось значуще та бездоганне. Тож, наливай каву — і нехай почнеться магія.",
    },
    skills: {
      title: "Мої навички",
      subtitle: "Технології, які лежать в основі моїх рішень",
    },
    projects: {
      title: "Проєкти",
      subtitle: "Ідеї, перетворені на код — створімо щось неймовірне разом",
    },
    contact: {
      title: "Зв’язатися зі мною",
      subtitle:
        "Напишіть мені для співпраці, фрилансу або просто щоб привітатися!",
      form: {
        name: "Ім’я*",
        email: "Ел. пошта*",
        message: "Повідомлення*",
        button: "Надіслати повідомлення",
        success: "✅ Ваше повідомлення надіслано!",
      },
    },
    footer: {
      copyright: " Всі права захищені.",
    },
    buttons: {
      login: "Увійти",
      logout: "Вийти",
      lang: "Мова",
      theme: "Тема",
      wiewcv: "Резюме",
    },
    validation: {
      name: {
        tooShort: "Ім'я закоротке.",
        invalid: "Ім'я може містити лише літери та пробіли.",
        required: "Ім'я є обов'язковим.",
      },
      email: {
        invalid: "Некоректна електронна адреса.",
        tooLong: "Електронна адреса надто довга.",
        required: "Електронна адреса є обов'язковою.",
      },
      password: {
        invalid: "Невірний пароль.",
        tooShort: "Занадто короткий.",
        tooLong: "Занадто довгий.",
        required: "Пароль обов'язковий.",
      },
      message: {
        tooShort: "Повідомлення повинно містити не меньше 10 символів.",
        required: "Повідомлення є обов'язковим.",
      },
    },
    modal: {
      login: {
        title: "Адмінка",
        login: "Увійти",
        cancel: "Скасувати",
        message: {
          no: "Доступ обмежено: тільки для адміністратора",
          yes: "Привіт, Адмін",
        },
      },
      logout: {
        title: "Адміне, вже йдеш?",
        logbtn: "Так",
        cancel: "Скасувати",
        message: {
          error: "Сталася помилка виходу",
          success: "Вихід виконано успішно",
        },
      },
      register: {
        title: "Реєстрація",
        register: "Зареєструватися",
        cancel: "Скасувати",
        message: {
          success: "Реєстрація пройшла успішно",
          error: "Помилка під час реєстрації",
          exists: "Користувач уже зареєстрований",
          confirm_password: "Підтвердження пароля*",
        },
      },
      form: {
        name: "Ім’я*",
        email: "Ел. пошта*",
        password: "Пароль*",
      },
    },
  },
};
